{
    "_id": "7d41aa0268b631d9",
    "_key": "!journal!7d41aa0268b631d9",
    "_stats": {
        "compodiumSource": null,
        "coreVersion": "12.327",
        "createdTime": 1721459260.734043,
        "duplicateSource": null,
        "lastModifiedBy": "dOcXwrUs2VunZl0y",
        "modifiedTime": 1721459260.734043,
        "systemId": "dc20rpg",
        "systemVersion": "0.8.0"
    },
    "flags": {},
    "folder": null,
    "name": "20 - Game Master Guide",
    "ownership": {
        "dOcXwrUs2VunZl0y": 3,
        "default": 0
    },
    "pages": [
        {
            "_id": "9ac52c3228c2a8a7",
            "_key": "!journal.pages!7d41aa0268b631d9.9ac52c3228c2a8a7",
            "_stats": {
                "compodiumSource": null,
                "coreVersion": "12.327",
                "createdTime": 1721459260.734043,
                "duplicateSource": null,
                "lastModifiedBy": "dOcXwrUs2VunZl0y",
                "modifiedTime": 1721459260.734043,
                "systemId": "dc20rpg",
                "systemVersion": "0.8.0"
            },
            "flags": {},
            "image": {},
            "name": "Game Master Guide",
            "ownership": {
                "dOcXwrUs2VunZl0y": 3,
                "default": -1
            },
            "sort": 1,
            "src": null,
            "system": {},
            "text": {
                "content": "",
                "format": 1
            },
            "title": {
                "level": 0,
                "show": true
            },
            "type": "text",
            "video": {
                "controls": true,
                "volume": 0.5
            }
        },
        {
            "_id": "b7fa2e8832668a0e",
            "_key": "!journal.pages!7d41aa0268b631d9.b7fa2e8832668a0e",
            "_stats": {
                "compodiumSource": null,
                "coreVersion": "12.327",
                "createdTime": 1721459260.734043,
                "duplicateSource": null,
                "lastModifiedBy": "dOcXwrUs2VunZl0y",
                "modifiedTime": 1721459260.734043,
                "systemId": "dc20rpg",
                "systemVersion": "0.8.0"
            },
            "flags": {},
            "image": {},
            "name": "Variable Attribute Skill Checks",
            "ownership": {
                "dOcXwrUs2VunZl0y": 3,
                "default": -1
            },
            "sort": 2,
            "src": null,
            "system": {},
            "text": {
                "content": "<p>Each Skill has a Base Attribute that is its “home” on the Character Sheet. This is the “default” Attribute you would add to each Skill unless the GM calls for something else. In most scenarios you’ll find yourself using the Skill’s Base Attribute.</p><div class=\"book-block book-block-example>When your GM tells you to “Make an Athletics Check”, that’ll most likely be based off of your Might Attribute. When your GM tells you to “Make an Influence Check” that’ll most likely be based off of your Charisma Attribute.</div><p>This keeps the game moving quickly and avoids confusion on which Attribute you add to a given Check. If you’re interested in a more customizable and creative approach to Skills, then here’s how the “Variable Attribute Rule” works.</p>",
                "format": 1
            },
            "title": {
                "level": 1,
                "show": true
            },
            "type": "text",
            "video": {
                "controls": true,
                "volume": 0.5
            }
        },
        {
            "_id": "14073f414cbcec0c",
            "_key": "!journal.pages!7d41aa0268b631d9.14073f414cbcec0c",
            "_stats": {
                "compodiumSource": null,
                "coreVersion": "12.327",
                "createdTime": 1721459260.734043,
                "duplicateSource": null,
                "lastModifiedBy": "dOcXwrUs2VunZl0y",
                "modifiedTime": 1721459260.734043,
                "systemId": "dc20rpg",
                "systemVersion": "0.8.0"
            },
            "flags": {},
            "image": {},
            "name": "Variable Attribute Rule",
            "ownership": {
                "dOcXwrUs2VunZl0y": 3,
                "default": -1
            },
            "sort": 3,
            "src": null,
            "system": {},
            "text": {
                "content": "<p>Which Attribute you use for a given Skill Check depends on HOW you’re using the Skill. This is a much more “open” approach to Skill Checks and can be used to create any possible Check.</p><div class=\"book-block book-block-dctip>Players can get creative with alternative Attributes for Checks, but the GM always retains the authority to decide which Check the player will make.</div><p>Determining the default Check can be straightforward. However, what if the PC wants to use a different Attribute or Skill with the Check or the GM wants to make the Check more precisely match the actions of the PC? This is where the Variable Attribute Rule comes in. There are 2 things to determine when making a Variable Skill Check:</p><p><strong><em>Determine the Skill: </em></strong>Which SKILL is the PC trying to use at this moment? Based on what they’re trying to accomplish, the Skill being used is usually pretty obvious.</p><p><strong><em>Determine the Attribute: </em></strong>Which ATTRIBUTE are they using to accomplish this task? How are they using their Skill? Are they using Might, Agility, Intelligence, or Charisma to make this Check? There are many ways to approach the actions a PC might take during gameplay. See the examples below.</p><div class=\"book-block book-block-dctip>The GM should ideally choose a Variable Check that is well suited for the PC. If the Variable Check is worse off for the PC, they can always choose to use the “default” Skill Check instead.</div>",
                "format": 1
            },
            "title": {
                "level": 2,
                "show": true
            },
            "type": "text",
            "video": {
                "controls": true,
                "volume": 0.5
            }
        },
        {
            "_id": "36b2705d1efae1b1",
            "_key": "!journal.pages!7d41aa0268b631d9.36b2705d1efae1b1",
            "_stats": {
                "compodiumSource": null,
                "coreVersion": "12.327",
                "createdTime": 1721459260.734043,
                "duplicateSource": null,
                "lastModifiedBy": "dOcXwrUs2VunZl0y",
                "modifiedTime": 1721459260.734043,
                "systemId": "dc20rpg",
                "systemVersion": "0.8.0"
            },
            "flags": {},
            "image": {},
            "name": "Variable Check Examples",
            "ownership": {
                "dOcXwrUs2VunZl0y": 3,
                "default": -1
            },
            "sort": 4,
            "src": null,
            "system": {},
            "text": {
                "content": "<p>Here are some examples of Variable Attributes being applied to scenarios for some great Skill Check results. I challenge you to think of how you could combine each of the 4 Attributes to each of the 13 General Skills. The format for describing these checks is “Skill (Attribute) Check” with the Skill being the first word and the Attribute being used is inside of the parenthesis.</p><p><strong><em>Animal (Might) Check:</em></strong> A PC is wrestling a wild boar.</p><ul><li>Yes this could be an Athletics (Might) Check, and maybe for most characters, that's what it would be. BUT if you have a unique character that has a really high Animal Skill… it might make more sense for them to use that expertise with animals to their advantage.</li><li>Alternatively, when you try and quickly grab an Animal you could make an Animal (Agility) Check.</li></ul><p><strong><em>Trickery (Charisma) Check:</em></strong> A PC is trying to impersonate the speech or accent of another NPC to try to trick them into thinking they’re someone else.</p><ul><li>Yes this could be an Influence (Charisma) Check, because they’re talking to another NPC to convince them of something… BUT if a character has put a lot of points into Trickery, it makes sense for this sly character to be able to impersonate people better than most.</li><li>Trying to devise a cunning plan to sneak into a location and infiltrate it you could make a Trickery (Intelligence) Check.</li></ul><p><strong><em>Medicine (Agility) Check: </em></strong>A PC is trying to carefully remove metal shards from an ally.</p><ul><li>Yes, I know Medicine’s “home” is Intelligence… and I would usually have Medicine Checks be used to see if you KNOW something about things having to do with medicine. BUT this is a careful application of your medical knowledge needing the use of your “agile” hand movements. I could even see someone using a Medicine (Might) Check to perform CPR or jam a dislocated shoulder back into place.</li></ul><p><strong><em>Intimidation (Intelligence) Check:</em></strong> A PC is trying to convince an NPC not to go into the dangerous forests, so they start listing off a bunch of scary facts about how terrifying a beast that lives in this forest is.</p><ul><li>Intimidation can easily be any of the 4 Base Attributes. Breaking something in half would be Might, throwing a dagger right next to someone's head barely missing them would be Agility. When trying to manipulate a creature’s actions using a social threat, extortion, or blackmail, you could make an Intimidation (Charisma) Check. If your threat involves knowledge of key information or about the target specifically you could make an Intimidation (Intelligence) Check.</li></ul><p><strong><em>Insight (Intelligence) Check:</em></strong> A PC is trying to figure out something based on past experiences to put some pieces together. You can think of this as a PC’s intuition.</p>",
                "format": 1
            },
            "title": {
                "level": 3,
                "show": true
            },
            "type": "text",
            "video": {
                "controls": true,
                "volume": 0.5
            }
        }
    ],
    "sort": 0
}