{
  "name": "Game Master Guide",
  "pages": [
    {
      "_id": "d8186154fd63a725",
      "name": "Variable Attribute Skill Checks",
      "sort": 1,
      "text": {
        "content": "<p id=\"2be1b90a-e081-803f-ba67-f39922931bdf\">Each Skill has a Base Attribute that is its “home” on the Character Sheet. This is the default Attribute you would add to each Skill unless the GM calls for something else. In most scenarios, you will find yourself using the Skill’s Base Attribute.</p><p id=\"2be1b90a-e081-8038-9ebd-ddef4a144b41\" class=\"block-color-blue_background\">Example: When your GM tells you to make an Athletics Check, that’ll most likely be based off your Might Attribute. When your GM tells you to make an Influence Check, that’ll most likely be based off your Charisma Attribute.</p><p id=\"2be1b90a-e081-8057-990e-d3cce40df652\">This keeps the game moving quickly and avoids confusion on which Attribute you add to a given Check. If you’re interested in a more customizable and creative approach to Skills, then here is how the “Variable Attribute Rule” works.</p>",
        "format": 1
      },
      "title": {
        "level": 2,
        "show": true
      },
      "type": "text",
      "system": {},
      "image": {},
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "category": null,
      "flags": {},
      "_stats": {
        "compendiumSource": null,
        "duplicateSource": null,
        "exportSource": null,
        "coreVersion": "13.350",
        "systemId": "dc20rpg",
        "systemVersion": "0.10.0.0",
        "lastModifiedBy": null
      },
      "ownership": {
        "default": -1
      },
      "_key": "!journal.pages!V0UryXfLNxCWgMsB.d8186154fd63a725"
    },
    {
      "_id": "06fea10508365e2d",
      "name": "Variable Attribute Rule",
      "sort": 2,
      "text": {
        "content": "<p id=\"2be1b90a-e081-8094-92ef-ef73b470958e\">Which Attribute you use for a given Skill Check depends on how you’re using the Skill. This is a much more open approach to Skill Checks, and can be used to create any possible Check.</p><p id=\"2be1b90a-e081-8080-ac3d-c20900f190b9\" class=\"block-color-purple_background\"><strong>DC Tip:</strong> Players can get creative with alternative Attributes for Checks, but the GM always retains the authority to decide which Check the player will make.</p><p id=\"2be1b90a-e081-8036-96d7-fd61ca96909e\">Determining the default Check can be straightforward, but what if the PC wants to use a different Attribute or Skill with the Check or the GM wants to make the Check more precisely match the actions of the PC? This is where the Variable Attribute Rule comes in. There are 2 things to determine when making a Variable Skill Check:</p><p id=\"2be1b90a-e081-80d7-834e-e0fad1f51844\"><strong>Determine The Skill:</strong> Which skill is the PC trying to use in this moment? Based on what they’re trying to accomplish, the Skill being used is usually pretty obvious.</p><p id=\"2be1b90a-e081-80d5-b29a-e3d4a516da0b\"><strong>Determine The Attribute:</strong> Which attribute are they using to accomplish this task? How are they using their Skill? Are they using Might, Agility, Intelligence, or Charisma to make this Check? There are many ways to approach the actions a PC might take during gameplay. See the examples below.</p><p id=\"2be1b90a-e081-8011-b576-f007401b32b2\" class=\"block-color-purple_background\"><strong>DC Tip:</strong> The GM should ideally choose a Variable Check that is well-suited for the PC. If the Variable Check is worse off for the PC, they can always just choose to use the “default” Skill Check instead.</p><p id=\"2be1b90a-e081-805d-af3e-c331d813bcdf\"><strong><span style=\"border-bottom:0.05em solid\">Variable Check Examples</span></strong></p><p id=\"2be1b90a-e081-8016-a362-c9a16c767421\">Here are some examples of Variable Attributes being applied to scenarios for some great Skill Check results. I challenge you to think of how you could combine each of the 4 Attributes to each of the 13 General Skills. The format for describing these Checks is “Skill (Attribute) Check” with the Skill being the first word and the Attribute being used inside of the parentheses. </p><ul id=\"2be1b90a-e081-8030-8c67-c60baf8859fd\" class=\"bulleted-list\"><li style=\"list-style-type:disc\"><em><strong>Animal (Might) Check:</strong></em> A PC is wrestling a wild boar.<div style=\"display:contents\" dir=\"auto\"><ul id=\"2be1b90a-e081-80ed-a06f-e6f0d871c3ca\" class=\"bulleted-list\"><li style=\"list-style-type:circle\">Yes this could be an Athletics (Might) Check, and maybe for most characters, that's what it would be. BUT if you have a unique character that has a really high Animal Skill… it might make more sense for them to use that expertise with animals to their advantage.</li></ul></div><div style=\"display:contents\" dir=\"auto\"><ul id=\"2be1b90a-e081-80b5-9fae-eea90cb8bbdf\" class=\"bulleted-list\"><li style=\"list-style-type:circle\">Alternatively, when you try to quickly grab an Animal you could make an Animal (Agility) Check. </li></ul></div></li></ul><ul id=\"2be1b90a-e081-8057-b548-d0a12a190342\" class=\"bulleted-list\"><li style=\"list-style-type:disc\"><em><strong>Trickery (Charisma) Check:</strong></em> A PC is trying to impersonate the speech or accent of another NPC to trick someone into thinking they’re someone else.<div style=\"display:contents\" dir=\"auto\"><ul id=\"2be1b90a-e081-80e9-b5f2-fb438b1c131e\" class=\"bulleted-list\"><li style=\"list-style-type:circle\">Yes, this could be an Influence (Charisma) Check, because they’re talking to another NPC to convince them of something, but if a character has put a lot of points into Trickery, it makes sense for this “sly” character to be able to impersonate people better than most.</li></ul></div><div style=\"display:contents\" dir=\"auto\"><ul id=\"2be1b90a-e081-8091-9336-e467dbb2bcf7\" class=\"bulleted-list\"><li style=\"list-style-type:circle\">If they were trying to devise a cunning plan to sneak into a location and infiltrate it, they could make a Trickery (Intelligence) Check instead.</li></ul></div></li></ul><ul id=\"2be1b90a-e081-802c-9444-d6f40e750e59\" class=\"bulleted-list\"><li style=\"list-style-type:disc\"><em><strong>Medicine (Agility) Check:</strong></em> A character is trying to carefully remove metal shards from an ally.<div style=\"display:contents\" dir=\"auto\"><ul id=\"2be1b90a-e081-8027-b54d-c886dd44a868\" class=\"bulleted-list\"><li style=\"list-style-type:circle\">Yes, I know Medicine’s “home” is Intelligence, and I would usually have Medicine Checks be used to see if you know something about things having to do with medicine. This, though, is a careful application of your medical knowledge needing the use of agile hand movements. I could even see someone using a Medicine (Might) Check to perform CPR or to jam a dislocated shoulder back into place.</li></ul></div></li></ul><ul id=\"2be1b90a-e081-80fd-971c-f6a95d7b0113\" class=\"bulleted-list\"><li style=\"list-style-type:disc\"><em><strong>Intimidation (Intelligence) Check:</strong></em> A character is trying to convince an NPC not to go into the dangerous forests, so they start listing off a bunch of scary facts about how terrifying a beast that lives in this forest is.<div style=\"display:contents\" dir=\"auto\"><ul id=\"2be1b90a-e081-809a-9316-d7eaa168ef79\" class=\"bulleted-list\"><li style=\"list-style-type:circle\">Intimidation can easily be any of the 4 Base Attributes. Breaking something in half would be Might. Throwing a dagger right next to someone's head barely missing them would be Agility. Trying to manipulate a creature’s actions using a social threat, extortion, or blackmail, could be an Intimidation (Charisma) Check. If your threat involves knowledge of key information or about the target specifically, you could make an Intimidation (Intelligence) Check.</li></ul></div></li></ul><ul id=\"2be1b90a-e081-80d1-ae0c-ee528237c680\" class=\"bulleted-list\"><li style=\"list-style-type:disc\"><em><strong>Insight (Intelligence) Check:</strong></em> A PC is trying to figure something out based on past experiences. You can think of this as a PC’s intuition.</li></ul><p id=\"2be1b90a-e081-80c5-9721-f282ceefafd0\">\n</p>",
        "format": 1
      },
      "title": {
        "level": 3,
        "show": true
      },
      "type": "text",
      "system": {},
      "image": {},
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "category": null,
      "flags": {},
      "_stats": {
        "compendiumSource": null,
        "duplicateSource": null,
        "exportSource": null,
        "coreVersion": "13.350",
        "systemId": "dc20rpg",
        "systemVersion": "0.10.0.0",
        "lastModifiedBy": null
      },
      "ownership": {
        "default": -1
      },
      "_key": "!journal.pages!V0UryXfLNxCWgMsB.06fea10508365e2d"
    }
  ],
  "folder": "2xElONkS7TH2Vxzr",
  "categories": [],
  "flags": {},
  "_stats": {
    "compendiumSource": null,
    "duplicateSource": null,
    "exportSource": null,
    "coreVersion": "13.350",
    "systemId": "dc20rpg",
    "systemVersion": "0.10.0.0",
    "createdTime": 1768509181086,
    "modifiedTime": 1768509600734,
    "lastModifiedBy": "dOcXwrUs2VunZl0y"
  },
  "ownership": {
    "default": 0,
    "dOcXwrUs2VunZl0y": 3
  },
  "_id": "V0UryXfLNxCWgMsB",
  "sort": 700000,
  "_key": "!journal!V0UryXfLNxCWgMsB"
}
